#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-3v2dBvCkormNjHtH

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_instance.composer_external: Refreshing state... [id=i-006c1b00085972e8d]
aws_instance.composer_internal: Refreshing state... [id=i-04fa20b9e3f3d85d1]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3224493979]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-4047416848]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-b273ee2c-64cd-4cb8-bd9e-8f93ed4267b3]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-37370f67-9b46-4ad4-9b49-33b2bac54fa2]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTcyLjMxLjY0LjExCk9TQlVJTERfQ0FfQ0VSVD1MUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VSRVZFTkRRV1pYWjBGM1NVSkJaMGxWVUROUU0yWXpOVkJHVWs1MWIyWjBlbU01VERrMlJHaFViMlJCZDBSUldVcExiMXBKYUhaalRrRlJSVXdLUWxGQmQwWnFSVlZOUWtsSFFURlZSVUYzZDB4aU0wNXBaRmRzYzFwRE5YWmpiV04zU0doalRrMXFRWGRQVkVWNlRWUlplVTFFVlROWGFHTk9UWHBCZHdwUFZFVjRUVlJaZVUxRVZUTlhha0ZYVFZKUmQwVm5XVVJXVVZGRVJFRjBkbU15U2pGaFYzaHJURzA1ZVZwNlEwTkJVMGwzUkZGWlNrdHZXa2xvZG1OT0NrRlJSVUpDVVVGRVoyZEZVRUZFUTBOQlVXOURaMmRGUWtGTlFuQnJXVkZZU1ZOTVl6aExXV3BOVVZsbmVuQlJPVU5CTTFKTE1tZElSREJ4WVhGemRqZ0tZVkpqVmtNMk5sTTVaa2h4UlVVeGFVeFZXRTgzTURKUmVqVnphMnBvTTNweFRIbEhVamgzVWxZdkwyTkpNV0l4Y2pCVmVWcFRZMHhhTTFjM1ZWcHlRd28wTkRSbVkzb3pUWGw0YkZONlYxVlpVMUJuUWtsTGFHZEJPSEZ0Y2xwU01XOW1ZV1J5ZUhWU1RDdHpia1pFU1d0NE0zY3JZekZLWlZWdU1tTnNNRmRwQ2xWMFdESkhSMVpEUmxkTlQyRnZaa1JyV0ZWRFJuVkxTSGRLVVdkR1RIUnpTRU5hV1dObWRsZFdTRnBhTms0NGQwZHdNbEZhV1RJNVl6aDFiWEJxTVZBS1VFWnNXRU00WkdGYVRFMWhXRmxpUlRCTlNYUldNRU5JU25CM1IwbHdZbmx1YlZsVWJDdHpSblYyYkRSdlZHMXllSG92ZVhoNmNFUjJWazFQY2tGSmJRcDRiMnMzY2xWdFZIVmtSR1ZGVTFKQ1QyZEJNVXQxWVUxU1ZIVmhTWEJSYnpKa2IzWnhLekF4Um1ZelFVNHlWVU5CZDBWQlFXRk9WRTFHUlhkSVVWbEVDbFpTTUU5Q1FsbEZSa28zWlRaWU0za3daRzlzY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFDT0VkQk1WVmtTWGRSV1UxQ1lVRkdTamRsTmxnemVUQmtiMndLY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFCT0VkQk1WVmtSWGRGUWk5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWdwQlJucDJOMmxsUzBjNWJGcExja0l5VFcxYWFFRnhTRWxNZVd4aFQzbFdjVGMzUnpsQ1RWSlVSbk53V25VME1ISTNSMVIzWTBSb2RtZzFSVU52U0ZGaUNteHJkVEJZTlU5WVowUjJXSE5DY0c5R1NISjJNRXRQU1d4VE4xVktNWFl3TkdzdlNsbG5XSGNyYkdwVVZITXZPWHB3YmpoU1ZteHRjSFV2UjAxUFRUVUtVV0pIVUN0T2FqVmFjelZtUjBaWGFFNDNUVEkxVVd0Vk9ESktiSGhsU2tGc1VYaElRMnhEVUdWNFVrTk5ZVEY1TlhBM1ZHNW5PREJMU2xkMGVWQlFPUXAwVTJkTlFuQTNOVlZTWlc4ME5VVTRVRXB5U25BemFIbHZORko0T1ZKUlIydHllV05TU1hkbVFraDJhM2hOU21adWMyTTNXUzkyTldsMVJqaHRlRTE2Q2pOMFlrbzVLMHA1UlVGMVNIb3hZa2QxY1VOWUszRktVVlJVZEM5UmJ6WXlka2RYWVVrNVUxWkxZbE00WVZoTVF6Sk9ObkZqYVdKeGNqVTRaalJFU2tRS1NuTnNUUzgzY0hONWNqRnZOWFIwWWtKdU5sazFRWE05Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLCldPUktFUl9TU0xfS0VZU19BUk49YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy1lYXN0LTE6OTMzNzUyMTk3OTk5OnNlY3JldDpicmV3X2tleXMtN0ZVZWVsCgojIFZhcmlhYmxlcyBmb3IgdGhlIHNjcmlwdC4KQ09NUE9TRVJfRElSPS9ldGMvb3NidWlsZC1jb21wb3NlcgoKIyBBZGQgbWhheWRlbidzIFNTSCBrZXkgdGVtcG9yYXJpbHkuCmN1cmwgaHR0cHM6Ly9naXRodWIuY29tL21ham9yLmtleXMgPj4gL2hvbWUvZWMyLXVzZXIvLnNzaC9hdXRob3JpemVkX2tleXMKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT1NFUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPU0VSX0hPU1R9Ojg3MDAKCg==" -> "H4sIAAAAAAAA/9RYW5PiOJZ+J6L+gze7I3Y3agFfMCQ5nR2DweZqGcuWfJndyPBFYGNhO21x7a7/vgFJ1mRlZc/0xPRL84Skc3SOvvj0nSMPi5yRnDXtU0keuO2OsrQMKtbepkcS/4ULi10eB9Xp8U6f6qpiIDAaQO+ucRk1ManqtMgfOKHFf2p8ajSbb40+NV73HqV1WdQpu9oGjAVRsiU5+wu3SinJgy15vEvzlLWi1fru7152FeT1ilRNNY+KOM3XD1wvTNkbg2vKjBxZO6LFLm5GRb5K158aerol3yX3w1ubRmNXk6p+aHBck7tk8MCRSGxeJhscx3F1nTwFO5YUVXom8VNGTlfby6/J3dV10qzqgBsMBgNFAudgKJwiUb0MRwNzoAwGg+HAHB43K206pePVMO+nEZ2ctk6lKpWNRLrosswa2wIpe/FweT4IG6/r5IlJl65ekmWVgiNw6fg+cox+G2qlEvPnvnYAp8/Zap30V7sT8Dr96Wc96BonGytrOQGFdlxBdyynExa1LZPmoaql89LKOjQti47pM4Vt14PndWYNuqNzclqH3Z2s99OjPT12HGWzs3R+7JpnsCnJ6pQ6u8/1FH5ORFSZ2Xyg7HZTzwyrDf2sJXgbLPbV/mQb4q422D73lE0SLg8noyc6y01QzuN2P7GD56UqHLRTF2li7kad5frAr1Mz7NZpqNnnHrDJ0ZFks3//XJqGo3vzqFz7FbWCyWTuW3rCzkZPj/3KWGjILSxhQAanzjphEagMxaahbO2XPel85p8VqInR0OgY/KGUD4fnZbI/iDkLpdJeLFlM2OwzlnlzmZe5e7Ks3C/Fs3aIiCiE7rHby5M+zZNF5a83pBcVZr4caMd2RKWuas1O63S3jJTD50y493bU0130HCgsO8wWGdyMyo3tikTWZ0K3GPXq2STqtB05O60W+1ivcRI/C0N3MsbYKM/FOuT7MvZSHrpamfuwLRC8HrbhZwefmLfy7vlqhY0oHhTi2F/lM/nsQeTOZn3dz4L8eJTUHjLSTJ2Bfo02Is+fu8PTiZ+ups92OBMUedVbxVIQwWrRGUUeirVpW1BOwOlqwqYX+elgbMzmIDy7Gm9LbHV/5IlgPj5y22BTVH+tSJwErBUV27tv+U5iUZaF/pXzwxfOU380FYCtype56VIRNhrtlF3NVtLjxO4ejKzr3uebtt8jxRKYalvnD/POvTzninAXB+k3wRqHKmXk6aIIt2tZBix54NpsW75c76eLRjztg6q+Zha9qMAD9+stUcNS0HQxehoauj61H++lKFjd8zyRRVnshB2hs+qt5HAlB4SPpagviNF9X+iLN++hoS8NS4Wv7v1QjOWuLHfknixK0n2vI4QSEQMSrO57UrdHRCm4F+PO++CDp6EK7ceFxbOFJQwhimd2qowgniEL+TOT1xC8rvFsmAkzC0EVq2BkOr7r85pkoZni8xSjETB10TsDrIxRJguh6PNkq8v2KBPhOEGhCJWYh9BB5SIUylkw8Td2pkGIDnOTakrM+88QY2BmdGLaGoZIk2L+mOq8XPpaXEdCOQKuvwkdIFnjZGNnwrPpxkus4q6NoU+QoGIbuMEYGLZbKvGhvKx1vlnLNNfGMxjzOHcQdBDWVKhqfLzVT9ZGS7CUVPaYlwkuuyYPFMRTCWqab2Vs72S0iLfAGF5zng0R0lRfjDWkaurV1umPLmMz04CZK5WDNc/CQPfOycJxSoAwzUmuQAMBRRdmC30bT+FIOXqudo4367mHZxuc6SKguuxnyREidAzQETvqvaSPZpBs8DkQy0KXyqM9oRO0SSREvf1CBDPdmR6jjYIJLm2PPwa6EEkYlyfzUPBgBLeeVJxtl3ZCDXSxgH0kKLmZ0UUwjhVjorGIlpbu9LeeA09kgi17yM5h5quWwzq6FFXeWZv7GO/0Lah1LS6HFPPOaDaBgj+CNAa2qO39DFaOhkcwxwtrEs+RE4/tCTxbKggcB2xjGjuWVgYg63RiPj7oVAsceyp750QIXeVZx4M5Uv3aUfWOP9YCWxUSR6MptBVgudDRVTC1ckWCPD14Od2FmKJwyM4wx2I4gns8Fk5kUuyJm3QjFYo4E5ZRps1Cs+yEYi1FFDM8wRkcYw0Js6EtxoqOmOAhwcITnFiuAsPzLAsl/zg/D45w651N1DlhBJSYx4rpaAZWhTF04ynCVB1S39LV/tCkVINZIfm27+lSdvDH/Tqy+nOP+qWX0TIW4Q4JgwpkwtBQY0XHOLPcGDpIGHpIG1ubmAK6PhNbyULxMP8NX+XVF7qxZqZ9CSEfmEgYmo7X+fheHb9y1FyXCsxLEYiUWnwkh1q5iLLpyXaEIFC1o6VSnTjHxJaoE9mRBM90aOMZgjk4ODni9clUggKUPB4W8XYtQAT2lqalw+2xim3FA6jv+TwUnQkYRuP+2JrMRF1lS8s52kDAc931DmBc7y1Kc2cSVeG4RHii7w23PISbxMLbI4smaA95YWnbaI6c2QQNmRFscBCd8RbyvhuoHcm2pwJyGDZGs3k4SaiVaTVyk6kpHkdojDsoA8CzNRm4AwmP5dwYKQuLxjzBimmYJY/EGJj5QAIYW75zzwOEOkgtT1Y+OAcTugfarGPgGYQiOxEHWJYbb80sEQMpAdbW30WiLjlWXwQOFeAmYUQVusMN4L2skOd8KUOkCdakOHpZLEQIeHNJmyMMUTzsw/DsneIsdj2UyUjwFx7VOx5OdPM8M0CubQJndow2qONvoGpl5tzKQW1b91I0AXK00fbAhbyXzXaAZoLp6v1h+qLJEMnqVAUaonAGMzoyMdRetJyfv68UE8OyH4NDfSlgZVGTqlXU4S6lcauo1u+NB6MRVC3rUeiJLUlodTstQbjZOAacq/DJshZPc9WzngYQPAZV/hAc6oeaRBVh9TbIgzWpHnZ1kwQ1awoPfUnqyaLQ7/X7/ZvVQ02qfRqRa7vanIpjySluISykWEM4XdpTAzzpAzAY3yrdAIz+jXi7sI6qtLw09s2bSzMqttsgj5uZ6dGi/xrfs2xVvyIGBrr6WLNgnebrJjkyUuUBbR6KKiNV3fq9cI6m8LFNWNS+2TRfnV4DqkOo2tbXs6pgtDSmwH5CcPGYMFbWD+32t4dtfT1sK9gG5yK/5dJ+2418FPK7iRYrtvTjJuVvWbFJ/+82CCgtDiR+iottkOY198j9jbtjJNi+Pfnd/3B3yS5shRU5vJ9/Qe37Je41QhRwj9zdx1lHQTOqWKskl+7rlt3Lhv9yfn9YHr/9hvxXXoPHZp0QSl+4+VvPwf9oh2neDoM6adSEcU2yK7gyLckqSGmjLnZVRD5uPhskSgruziKMpfmaq081I1suKWp2eUi27hqNHziLMI4l5LvFxuu/iFGuJqz5OuZ+fHdF/lRQvOhAeIEjzWsW5BHhWMHBCXiBA5J1WjNSXTH5anFIWXK1abR3ddWmRRTQaybBoea+vZvcmrDmy1RzH9Ad4f73citfp9KY+/GXf6ZxX7hfuc0z16y4u5Z19bNYlebrO+7nl9O9lbOnW+Cnm5y1NnWRN17d/5Hl3e/cjPuVuyJebbnm6vcm0PhIcm+fVLhmM9ix4s9EnBEpaXHiLvWKWxUV91oFrqS5LV4o86oV3HDARaRi6SqNAkZajTCoSbfDNWOuyf3000/cj7+8e4h94X7mfvzlbdn48kZwfitMRk5ckMffxvpDSPpBrf+nvHxB5VrVv6Xh3xfuPrZ84dhXhL6H4sWhmZHTFY53G0cV+zc3fsX5Dcm/O82fj6/XOnZR7g9Ye1H+XfnGpPEDZxsj47+2SXCKSf7fD5xDuJyQ+KKQUZHvSXWpFWl9GY+AxdHgopSHhOTcgXA02OVR0mpEAbsy/O4N0ree8stb9C/148sd9/PPb1P4E0H8WlZ35Q1X7tbV3vBdVqQMKsK9byP+s+Yqsi0Yee92vch1EWWE1a3GS0G+VF+SByElXLOZF4evu71scetG//oe1of7Hs9/B2az+anx/wEAAP//wcby5UYXAAA="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 8 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgVmFyaWFibGVzIGZvciB0aGUgc2NyaXB0LgpDT01QT1NFUl9ESVI9L2V0Yy9vc2J1aWxkLWNvbXBvc2VyCgojIEFkZCBtaGF5ZGVuJ3MgU1NIIGtleSB0ZW1wb3JhcmlseS4KY3VybCBodHRwczovL2dpdGh1Yi5jb20vbWFqb3Iua2V5cyA+PiAvaG9tZS9lYzItdXNlci8uc3NoL2F1dGhvcml6ZWRfa2V5cwoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPU0VSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9TRVJfSE9TVH06ODcwMAoK" -> "H4sIAAAAAAAA/9RY2XLjOJZ9V0T+A8dVETMTOZK4iJLlLle0KJFaCYogAS49Ew4ukEgRImkSWqvy3ycky9lOp2u6erpeyk8GcDceH5x74WGRM5Kzpn0qyQO33VGWlkHF2tv0SOK/cGGxy+OgOj3e6VNdVQwERgPo3TUuqyYmVZ0W+QMntPhPjU+NZvOt0afGa+xRWpdFnbKrbcBYECVbkrO/cKuUkjzYkse7NE9ZK1qt7/7uZVdBXq9I1VTzqIjTfP3A9cKUvTG4lszIkbUjWuziZlTkq3T9qaGnW/JdcT+8tWk0djWp6ocGxzW5SwUPHInE5mWzwXEcV9fJU7BjSVGlZxI/ZeR0tb38NLm7uk6aVR1wg8FgoEjgHAyFUySql+VoYA6UwWAwHJjD42alTad0vBrm/TSik9PWqVSlspFIF12WWWNbIGUvHi7PB2HjdZ08MenS1UuyrFJwBC4d30eO0W9DrVRi/tzXDuD0OVutk/5qdwJepz/9rAdd42RjZS0noNCOK+iO5XTCorZl0jxUtXReWlmHpmXRMX2msO168LzOrEF3dE5O67C7k/V+erSnx46jbHaWzo9d8ww2JVmdUmf3uZ7Cz4mIKjObD5TdbuqZYbWhn7UEb4PFvtqfbEPc1Qbb556yScLl4WT0RGe5Ccp53O4ndvC8VIWDduoiTczdqLNcH/h1aobdOg01+9wDNjk6kmz2759L03B0bx6Va7+iVjCZzH1LT9jZ6OmxXxkLDbmFJQzI4NRZJywClaHYNJSt/bInnc/8swI1MRoaHYM/lPLh8LxM9gcxZ6FU2osliwmbfcYyby7zMndPlpX7pXjWDhERhdA9dnt50qd5sqj89Yb0osLMlwPt2I6o1FWt2Wmd7paRcvicCffejnq6i54DhWWH2SKDm1G5sV2RyPpM6BajXj2bRJ22I2en1WIf6zVO4mdh6E7GGBvluViHfF/GXspDVytzH7YFgtfDNvzs4BPzVt49X62wEcWDQhz7q3wmnz2I3Nmsr/tZkB+PktpDRpqpM9Cv0Ubk+XN3eDrx09X02Q5ngiKveqtYCiJYLTqjyEOxNm0Lygk4XU3Y9CI/HYyN2RyEZ1fjbYmt7o88EczHR24bbIrqrxWJk4C1omJ79y3fSSzKstC/cn74wnnqj6YCsFX5sjddKsJGo52yq9lKepzY3YORdd37fNP2e6RYAlNt6/xh3rmX51wR7uIg/SZZ41CljDxdFOF2LcuAJQ9cm23Ll+v9dNGIp31Q1dfKohcVeOB+vRVqWAqaLkZPQ0PXp/bjvRQFq3ueJ7Ioi52wI3RWvZUcruSA8LEU9QUxuu8LffHmPTT0pWGp8NW9H4qx3JXljtyTRUm673WEUCJiQILVfU/q9ogoBfdi3HmffPA0VKH9uLB4trCEIUTxzE6VEcQzZCF/ZvIagtczng0zYWYhqGIVjEzHd31ekyw0U3yeYjQCpi56Z4CVMcpkIRR9nmx12R5lIhwnKBShEvMQOqhchEI5Cyb+xs40CNFhblJNiXn/GWIMzIxOTFvDEGlSzB9TnZdLX4vrSChHwPU3oQMka5xs7Ex4Nt14iVXctTH0CRJUbAM3GAPDdkslPpSXs843Z5nm2ngGYx7nDoIOwpoKVY2Pt/rJ2mgJlpLKHvMywWXX5IGCeCpBTfOtjO2djBbxFhjDa82zIUKa6ouxhlRNvdo6/dFlbWYaMHOlcrDmWRjo3jlZOE4JEKY5yRVoIKDowmyhb+MpHClHz9XO8WY99/BsgzNdBFSX/Sw5QoSOATpiR72X9NEMkg0+B2JZ6FJ5tCd0gjaJhKi3X4hgpjvTY7RRMMGl7fHHQBciCePyZB4KHozg1pOKs+3STqiBLhawjwQlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYR5eiyjtrcx/jnb4Fta7F5ZBi3hnNJlDwR5DGwBa1vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGSdTszHB51qgWNPZe+cCKGrPOt4MEeqXzuq3vHHWmCrQuJoNIW2AiwXOroKplauSJCnBy+nuxBTFA7ZGeZYDEdwj8fCiUyKPXGTbqRCEWfCMsq0WWiWnVCspYhihic4g2OsIWE2tMVY0RETPCRYeIITy1VgeJ5loeQf5+fBEW69s4k6J4yAEvNYMR3NwKowhm48RZiqQ+pbutofmpRqMCsk3/Y9XcoO/rhfR1Z/7lG/9DJaxiLcIWFQgUwYGmqs6BhnlhtDBwlDD2ljaxNTQNdnYitZKB7mv+GrvPpCN9bMtC8h5AMTCUPT8Tof36vjV46a61KBeSkCkVKLj+RQKxdRNj3ZjhAEqna0VKoT55jYEnUiO5LgmQ5tPEMwBwcnR7w+mUpQgJLHwyLergWIwN7StHS4PVaxrXgA9T2fh6IzAcNo3B9bk5moq2xpOUcbCHiuu94BjOu9RWnuTKIqHJcIT/S94ZaHcJNYeHtk0QTtIS8sbRvNkTOboCEzgg0OojPeQt53A7Uj2fZUQA7Dxmg2DycJtTKtRm4yNcXjCI1xB2UAeLYmA3cg4bGcGyNlYdGYJ1gxDbPkkRgDMx9IAGPLd+55gFAHqeXJygfnYEL3QJt1DDyDUGQn4gDLcuOtmSViICXA2vq7SNQlx+qLwKEC3CSMqEJ3uAG8lxXynC9liDTBmhRHL4uFCAFvLmlzhCGKh30Ynr1TnMWuhzIZCf7Co3rHw4lunmcGyLVN4MyO0QZ1/A1UrcycWzmobeteiiZAjjbaHriQ97LZDtBMMF29P0xfNBkiWZ2qQEMUzmBGRyaG2ouW8/P3nWJiWPZjcKgvDawsalK1ijrcpTRuFdX6vfFgNIKqZT0KfEviW8J9SxBuJo4B5yp8sqzF01z1rKcBBI9BlT8Eh/qhJlFFWL0N8mBNqodd3SRBzZrCQ1+SerIo9Hv9fv9m9RBW5HAdVZs9DRFCb/EtpFhDOF3aUwM86QMwGN+63ACM/v/J6l1YR1VaXob65s2lGRXbbZDHzcz0aNF/ze9Ztqpf0QIDXX2sWbBO83UzzRmp8oA2D0WVkapu/V4oR1P42CYsat9smq9OrwnVIVRt6+u3qmC0NKbAfkJw8ZgwVtYP7fa+jEiTjwVJkDsS35U7/VCI4mb/fKx6Z3nf+haM1lcwWhfHVrANzkV+K7j9dlz5qK7vNlqs2NKPp5i/ZcUm/Z/bIqC0OJD4KS62QZrX3CP3N+6OkWD7Fp67/+Lukl3Yuvz53++/QPv9EfeaIQq4R+7u46qjoBlVrFWSy3h2q+4l4D9d3x9Wx28/Mv+Z5+KxWSeE0hcC/9Z78d/aYZq3w6BOGjVhXJPsCq5MS7IKUtqoi10VkY+n0waJkoK7swhjab7m6lPNyJZLippdXpqtu0bjB84ijGMJ+e6w8fpbxChXE9Z8XXM/vrtHfyooXsQivMCR5jUL8ohwrODgBLzAAck6rRmprph8tTikLLnaNNq7umrTIgrotZLgUHPfXlBuTVjzZau5D+iOcP99uZWvW2nM/fjLPxLCL9yv3OaZa1bcXcu6+lmsSvP1Hffzy9e91bynW+Knm+a1NnWRN17d/y/Lu98ZjPuVuyJebbnm6vcW0PhIl2//c+GazWDHij8TcUakpMWJuzQ1blVU3GuruJLmdnihzKtWcMMBF5GKpas0ChhpNcKgJt0O14y5JvfTTz9xP/7y7qX2hfuZ+/GXt73lyxvB+a00GTlxQR5/m+sPIekH08A/5OULKtfW/y0N/35w97HlC8e+IvQ9FC8OzYycrnC8CxxV7F8M/IrzG5J/9zV/Pr5e+9hFuT9g7UX5d+Ubk8YPnG2MjP/YJsEpJvl/PnAO4XJC4otCRkW+J9WlV6T1ZT0CFkeDi1IeEpJzB8LRYJdHSasRBezK8Ls3SN+Gzi9v0b/0jy933M8/vy3hTwTxa1vdlTdcuZpU+zQiN3yXFSmDinDvx4h/r7mKbAtG3rtdL3JdRBlhdavx0pAv3ZfkQUgJ12zmxeFrtJcQt5H1r+9hfbjv8fx3YDabnxr/GwAA//8rky76ZxcAAA=="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118195524811200000001" -> (known after apply)
      ~ id                                  = "sfr-37370f67-9b46-4ad4-9b49-33b2bac54fa2" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210118195555325800000002" -> (known after apply)
      ~ id                                  = "sfr-b273ee2c-64cd-4cb8-bd9e-8f93ed4267b3" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "8" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*